app/controllers/friends_controller.rb

UPDATE "friends" SET "phone" = ?, "updated_at" = ? WHERE "friends"."id" = ?  [["phone", "111116876"], ["updated_at", "2023-03-01 05:48:47.055131"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @friend.update(friend_params)